ecommerce/app/controllers/shoppingcarts_controller.rb

  def index
    @shoppingcarts = Shoppingcart.all
---
SELECT * FROM `shoppingcarts`